0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

        Uref                 2.0;
        Zref                 1.5;
        zDir                 (0 0 1);
        flowDir              (1 0 0);
        z0                   uniform 0.2;
        d                    uniform 0.0;

// ************************************************************************* //
