system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application	simpleFoam;

startFrom	latestTime;

startTime	0;

stopAt		endTime;

endTime	5000;

deltaT		1;

writeControl	timeStep;

writeInterval	1000;

purgeWrite	0;

writeFormat	binary;

writePrecision	6;

writeCompression off;

timeFormat	general;

timePrecision	6;

runTimeModifiable true;


// ************************************************************************* //
